/**************************************************************************************/
/*! @file   ObjectUpdater.cs
***************************************************************************************
@brief      ゲームの更新処理クラス。ObjectBaseを継承したオブジェクトの更新処理用
***************************************************************************************
@author     橋本 航
***************************************************************************************/
using UnityEngine;
/**************************************************************************************
@brief  ゲームの更新処理クラス。
@note   Update関数を使うためMonoBehaviorを継承している　  
*/
public class BaseObjectUpdater : MonoBehaviour {

    /**************************************************************************************
    @brief  更新処理。MonoBehaviorの実装。
    */
    void Update()
    {

        foreach(var index in BaseObject.ObjectList)
        {
            index.mOnUpdate();
        }
        
    }

    /**************************************************************bu************************
    @brief  物理系の更新処理。MonoBehaviorの実装。
    */
    void FixedUpdate()
    {
        foreach (var index in BaseObject.ObjectList)
        {
            index.mOnFixedUpdate();
        }
    }
}
