/**********************************************************************************************/
/*! @file   SceneManager.cs
*********************************************************************************************
@brief      シーン管理クラス
*********************************************************************************************
@author     Ko Hashimoto
***************************************************************************************
* Copyright © 2016 Ko Hashimoto All Rights Reserved.
**********************************************************************************************/
using UnityEngine;
using System.Collections;

/******************************************************************************* 
@brief   シーン管理クラス
*/
public class SceneManager : BaseObject {

    

    // シーンのテーブル
    [SerializeField]
    SceneTable m_sceneTable;

    protected override void mOnRegistered()
    {
        base.mOnRegistered();
        mUnregisterList(this);
    }

}
