/**************************************************************************************/
/*! @file   GameManager.cs
***************************************************************************************
@brief      ゲーム全体のマネージャークラス
***************************************************************************************
@author     Ko Hashimoto
***************************************************************************************
* Copyright © 2016 Ko Hashimoto All Rights Reserved.
***************************************************************************************/
using UnityEngine;
using System.Collections;

public class GameManager : BaseObjectSingleton<GameManager> {

    /****************************************************************************** 
    @brief      初期化用
    @return     none
    */
    protected override void mOnRegistered()
    {
        base.mOnRegistered();

    }

}
