/**************************************************************************************/
/*! @file   DontDestroy.cs
***************************************************************************************
@brief      削除しないオブジェクト用コンポーネント。
***************************************************************************************
@author     Ko Hashimoto
***************************************************************************************/

/******************************************************************************* 
@brief   削除しないオブジェクト用コンポーネント。
*/
public class DontDestroy : BaseObject {

    /****************************************************************************** 
    @brief      BaseObjectの実装
    @note       管理リストに登録された時によばれる
    @return     none
    */
    protected override void mOnRegistered()
    {
        base.mOnRegistered();
        mUnregisterList(this);
        DontDestroyOnLoad(this.gameObject);
    }
}
